read_verilog -formal or1200_dc_fsm_dut.v
prep -top or1200_dc_fsm
memory -nordff
hierarchy -check
async2sync; 
dffunmap
setundef -undriven -init -expose
write_btor or1200_dc_fsm_dut.btor