read_verilog -formal b11_dut.v
prep -top b11
memory -nordff
#memory
hierarchy -check
async2sync; 
dffunmap
setundef -undriven -init -expose

write_btor b11_dut.btor