read_verilog -formal RocketTile_dut.v
prep -top RocketTile
chformal -assume -early
memory -nomap
hierarchy -check
async2sync;
dffunmap
setundef -zero
zinit -all
write_btor RocketTile_dut.btor